# DataFrame

Objeto bi-dimensional que contém dados em forma tabular.

In [28]:
import pandas as pd

Criando um DataFrame

In [29]:
df = pd.DataFrame()

In [30]:
dic_df = {'identificacao': [1,2,3,4,5],
          'nome': ['Rafael', 'Rafão', 'Rafux', 'Rafainha', 'Rafo']}

df1 = pd.DataFrame(data = dic_df)
df1

   identificacao      nome
0              1    Rafael
1              2     Rafão
2              3     Rafux
3              4  Rafainha
4              5      Rafo

In [31]:
#Passando parâmetros de índices

df2 = pd.DataFrame(data = dic_df, index= [22,45,71,23,33])
df2

    identificacao      nome
22              1    Rafael
45              2     Rafão
71              3     Rafux
23              4  Rafainha
33              5      Rafo

Criando DataFrame utilizando "array"

In [32]:
import numpy as np

In [33]:
array1 = np.array([[1, 2, 3],
                   ['Rio de Janeiro','São Paulo','Minas Gerais'],
                   ['RJ', 'SP', 'MG']])

array1

array([['1', '2', '3'],
       ['Rio de Janeiro', 'São Paulo', 'Minas Gerais'],
       ['RJ', 'SP', 'MG']], dtype='<U14')

In [34]:
df3 = pd.DataFrame(data = array1.transpose(),
                   index = ['linha1', 'linha2', 'linha3'],
                   columns = ['identificacao', 'cidade', 'estado'])
            
df3

       identificacao          cidade estado
linha1             1  Rio de Janeiro     RJ
linha2             2       São Paulo     SP
linha3             3    Minas Gerais     MG

In [35]:
df3['index'] = 0

df3

       identificacao          cidade estado  index
linha1             1  Rio de Janeiro     RJ      0
linha2             2       São Paulo     SP      0
linha3             3    Minas Gerais     MG      0

In [36]:
df3[['estado', 'cidade']]

       estado          cidade
linha1     RJ  Rio de Janeiro
linha2     SP       São Paulo
linha3     MG    Minas Gerais

In [37]:
df3[df3.estado == 'SP']

       identificacao     cidade estado  index
linha2             2  São Paulo     SP      0

loc: localiza pelo nome

iloc: localiza pela posição

In [40]:
df3.iloc[1]

identificacao            2
cidade           São Paulo
estado                  SP
index                    0
Name: linha2, dtype: object

Atributos de DataFrames

In [45]:
#tipos dos dados
df3.dtypes

identificacao    object
cidade           object
estado           object
index             int64
dtype: object

In [55]:
#alterando o tipo do dado
df3.identificacao = df3.identificacao.astype(int)

In [54]:
df3.dtypes

identificacao     int32
cidade           object
estado           object
index             int64
dtype: object